/*****************************************************************************
 *
 * アイテム表示処理 [item.h]
 *
 * 作る時間 ： 2015.5.1
 *
 * GP11A 248 朱鷹仁 40582
 *
 ******************************************************************************/
#ifndef _ITEM_H_
#define _ITEM_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	MAX_ITEM			(50)				// 最大数
//*****************************************************************************
// 構造体定義
//*****************************************************************************
typedef struct
{
	D3DXVECTOR3				pos;				// 位置
	D3DXVECTOR3				rot;				// モデルの回転
	
	float					fWidth;				// 幅
	float					fHeight;			// 高さ

	bool					bUse;				// 使用しているかどうか

	int						nCounterAnim;		// 计数器
	int						nPatternAnim;		// 记录图片帧
	int						nType;				// 类型
	int						nBelongTo;			// 誰の
}ITEM;

//////////////////////
// 贴图的种类名称
//////////////////////
enum
{
	ITEM_TYPE_01 = 0,			// タイプ０
	ITEM_TYPE_MAX
};


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitItem(void);
void UninitItem(void);
void UpdateItem(void);
void DrawItem(void);
void SetItem(D3DXCOLOR col, int ntype, int nBelongTo);
ITEM *GetItem(void);
void DeleteItem(int nDeleteNum);
#endif
