/*****************************************************************************
 *
 * スライド表示処理 [slider.h]
 *
 * 作る時間 ： 2015.5.1
 *
 * GP11A 248 朱鷹仁 40582
 *
 ******************************************************************************/
#ifndef _SLIDER_H_
#define _SLIDER_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	MAX_SLIDER								(1)		// 最大数
//*****************************************************************************
// 構造体定義
//*****************************************************************************
typedef struct
{
	D3DXVECTOR3				pos;				// 位置
	D3DXVECTOR3				rot;				// モデルの回転
	
	float					fWidth;				// 幅
	float					fHeight;			// 高さ
	float					fSpeed;				// すばやさ

	bool					bUse;				// 使用しているかどうか

	int						nCounterAnim;		// 计数器
	int						nPatternAnim;		// 记录图片帧
	int						nType;				// 类型

} SLIDER;

//////////////////////
// 贴图的种类名称
//////////////////////
enum
{
	SLIDER_POINT = 0,						// タイプ０
	SLIDER_TYPE_MAX
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitSlider(void);
void UninitSlider(void);
void UpdateSlider(void);
void DrawSlider(void);
void SetSlider(D3DXVECTOR3 pos, float fWidth, float fHeight, D3DXCOLOR col, int type);
#endif
